In [49]:
import pandas as pd 
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import OrdinalEncoder

In [50]:
%matplotlib inline

In [60]:
d = {'sales': [100000,222000,1000000,522000,111111,222222,1111111,20000,75000,90000,1000000,10000], 'city': ['Tampa','Tampa','Orlando','Jacksonville','Miami','Jacksonville','Miami','Miami','Orlando','Orlando','Orlando','Orlando'], 'size': ['Small', 'Medium','Large','Large','Small','Medium','Large','Small','Medium','Medium','Medium','Small',]}
df = pd.DataFrame(data=d) 
df.head()

     sales          city    size
0   100000         Tampa   Small
1   222000         Tampa  Medium
2  1000000       Orlando   Large
3   522000  Jacksonville   Large
4   111111         Miami   Small

In [61]:
ohe = OneHotEncoder(handle_unknown='ignore', sparse_output=False).set_output(transform='pandas')
ohe_transformed = ohe.fit_transform(df[['city']])

In [62]:
tr_df = pd.concat([df, ohe_transformed], axis=1).drop(columns=['city'])

In [63]:
tr_df

      sales    size  city_Jacksonville  city_Miami  city_Orlando  city_Tampa
0    100000   Small                0.0         0.0           0.0         1.0
1    222000  Medium                0.0         0.0           0.0         1.0
2   1000000   Large                0.0         0.0           1.0         0.0
3    522000   Large                1.0         0.0           0.0         0.0
4    111111   Small                0.0         1.0           0.0         0.0
5    222222  Medium                1.0         0.0           0.0         0.0
6   1111111   Large                0.0         1.0           0.0         0.0
7     20000   Small                0.0         1.0           0.0         0.0
8     75000  Medium                0.0         0.0           1.0         0.0
9     90000  Medium                0.0         0.0           1.0         0.0
10  1000000  Medium                0.0         0.0           1.0         0.0
11    10000   Small                0.0         0.0           1.0         0.0

In [ ]:
categories = [i for i in tr_df['size'].unique()]

# NÃºmero com base na ordem da lista
oe = OrdinalEncoder(handle_unknown='error', categories=[['Large', 'Small', 'Medium']])
tr_df['size'] = oe.fit_transform(tr_df[['size']])

In [65]:
tr_df

      sales  size  city_Jacksonville  city_Miami  city_Orlando  city_Tampa
0    100000   1.0                0.0         0.0           0.0         1.0
1    222000   2.0                0.0         0.0           0.0         1.0
2   1000000   0.0                0.0         0.0           1.0         0.0
3    522000   0.0                1.0         0.0           0.0         0.0
4    111111   1.0                0.0         1.0           0.0         0.0
5    222222   2.0                1.0         0.0           0.0         0.0
6   1111111   0.0                0.0         1.0           0.0         0.0
7     20000   1.0                0.0         1.0           0.0         0.0
8     75000   2.0                0.0         0.0           1.0         0.0
9     90000   2.0                0.0         0.0           1.0         0.0
10  1000000   2.0                0.0         0.0           1.0         0.0
11    10000   1.0                0.0         0.0           1.0         0.0